FemDesign.Geometry.Edge
edge_type
Curves in FEM-Design are expressed as edges. This extended edge also contains a LCS to keep track of directions.

FemDesign.Geometry.Edge.CoordinateSystem
Get/Set LCS
If no LCS exists on Edge (i.e. when an Edge was deserialized from path) an LCS will be reconstructed.

FemDesign.Geometry.Edge.#ctor
Parameterless constructor for serialization.

FemDesign.Geometry.Edge.#ctor(System.Double,System.Double,System.Double,FemDesign.Geometry.Point3d,FemDesign.Geometry.Vector3d,FemDesign.Geometry.CoordinateSystem)
Construct Edge of arc1 type.

FemDesign.Geometry.Edge.#ctor(FemDesign.Geometry.Point3d,FemDesign.Geometry.Point3d,FemDesign.Geometry.Point3d,FemDesign.Geometry.CoordinateSystem)
Construct Edge of arc2 type.

FemDesign.Geometry.Edge.#ctor(System.Double,FemDesign.Geometry.Point3d,FemDesign.Geometry.CoordinateSystem)
Construct Edge of circle type.

FemDesign.Geometry.Edge.#ctor(FemDesign.Geometry.Point3d,FemDesign.Geometry.Point3d,FemDesign.Geometry.CoordinateSystem)
Construct Edge of line type by points and coordinate system.

FemDesign.Geometry.Edge.#ctor(FemDesign.Geometry.Point3d,FemDesign.Geometry.Point3d,FemDesign.Geometry.Vector3d)
Construct Edge of line type by points and normal (localY).

FemDesign.Geometry.Edge.IsLine
Check if line

FemDesign.Geometry.Edge.IsLineVertical
Check if line is vertical (i.e. parallel to global Z)

FemDesign.Geometry.Edge.IsLineTangentEqualToGlobalZ
Check if line local x is equal to positive global Z

FemDesign.Geometry.Edge.Reverse
Reverse this edge

FemDesign.Geometry.Edge.op_Explicit(FemDesign.Geometry.Edge)~FemDesign.Geometry.LineSegment
Convert an Edge to a LineSegment
edge: